TRIGGERS = {
    "кому ты служишь": "Мой хояин слишком известен, чтобы его называть! Можете звать его просто - Солнцеликий!",
    "кто у нас тут главный": "Наша великая насяльника и глава клана - *Elisan*, в простонародье - *Анна*.",
    "основные наши правила": (
        "1. Не носить серьгу Линдвиора, если носишь её, то получаешь анальное зондирование.\n"
        "2. Не заливать вар никому.\n"
        "*3. Не ругаться с КЛ.*\n"
        "*4. Уважать мнение солнцеликого ЕГО.*"
    ),
    "код красный тут матюки": {
        "text": "У нас так не принято, подонок!\n",
        "image": "https://memepedia.ru/wp-content/uploads/2021/02/bonk-mem-bonk-8.jpg"
    },
    "на кол посадить": {
        "text": "Вот так примерно?\n",
        "gif": "https://lastfm.freetls.fastly.net/i/u/ar0/4192f84a3d4a4828c8c836229da960df.gif"
    },
}

WELCOME_TEXT = """Привет, {first_name}! Теперь ты часть команды. 
Быть в основе - означает участвовать в жизни и развитии клана.
Мы качаем учеников, делимся полезной информацией, отвечаем на вопросы, 
участвуем в клановых мероприятиях, организуем сборы, помогаем с прокачкой,ищем и приводим новых людей, 
проводим собеседования, разбираемся с варами (если изредка они появляются) и др.
Если ты новичок, то нам нужно увидеть, как ты сможешь поучаствовать в развитии клана, как ты сможешь нас усилить.
Прокачка своих основных персонажей и выполнение клановых миссий не считается. Это то, что каждый должен делать по умолчанию.
Если ты уже в основе, но никак в развитии клана не участвуешь, то ты и не участник клана. При нехватке свободных мест предпочтение будет отдаваться наиболее активным."""
